Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/codebase-overview_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: codebase-overview title: Codebase Overview layout: contributing permalink: docs/codebase-overview.html prev: how-to-contribute.html next: implementation-notes.html redirect_from:
ja: --- id: codebase-overview title: コードベースの概要 layout: contributing permalink: docs/codebase-overview.html prev: how-to-contribute.html next: implementation-notes.html redirect_from:

source: This section will give you an overview of the React codebase organization, its conventions, and the implementation.
ja: このセクションでは React コードベースの構成や規則そして実装についての概要を説明します。

source: If you want to [contribute to React](/docs/how-to-contribute.html) we hope that this guide will help you feel more comfortable making changes.
ja: あなたが [React にコントリビュート](/docs/how-to-contribute.html)したい場合に、このガイドがあなたがより快適に変更を行えるように手助けとなる事を願っています。

source: We don't necessarily recommend any of these conventions in React apps.
ja: これらの規約のいずれかをあなたの React アプリケーションで推奨しているというわけでは必ずしもありません。

source: Many of them exist for historical reasons and might change with time.
ja: 規約の多くは歴史的な理由で存在しており、時間とともに変化する可能性があります。

source: ### Top-Level Folders {#top-level-folders}
ja: ### 最上位フォルダ {#top-level-folders}

source: After cloning the [React repository](https://github.com/facebook/react), you will see a few top-level folders in it:
ja: [React リポジトリ](https://github.com/facebook/react)をクローンした後、プロジェクトのルートディレクトリに複数のフォルダがあることに気がつくでしょう：

source: * [`packages`](https://github.com/facebook/react/tree/main/packages) contains metadata (such as `package.json`) and the source code (`src` subdirectory) for all packages in the React repository.
ja: * [`packages`](https://github.com/facebook/react/tree/master/packages) には React リポジトリの全てのパッケージのメタデータ（`package.json` など）や、ソースコード（`src` サブディレクトリ）が含まれています。

source: **If your change is related to the code, the `src` subdirectory of each package is where you'll spend most of your time.** * [`fixtures`](https://github.com/facebook/react/tree/main/fixtures) contains a few small React test applications for contributors.
ja: **あなたの変更がコードに関するものなら、各パッケージの `src` サブディレクトリが作業時間のほとんどを過ごす場所となります**。* [`fixtures`](https://github.com/facebook/react/tree/master/fixtures) にはコントリビューター向けの React の小さなテスト用アプリケーションが含まれています。

source: * `build` is the build output of React.
ja: * `build` は React のビルド出力です。

source: It is not in the repository but it will appear in your React clone after you [build it](/docs/how-to-contribute.html#development-workflow) for the first time.
ja: リポジトリには存在しませんが、最初に [React をビルドした](/docs/how-to-contribute.html#development-workflow)後に clone した React ディレクトリに現れます。

source: The documentation is hosted [in a separate repository from React](https://github.com/reactjs/reactjs.org).
ja: ドキュメントは [React 本体とは異なるリポジトリ](https://github.com/reactjs/reactjs.org)にホスティングされています。

source: There are a few other top-level folders but they are mostly used for the tooling and you likely won't ever encounter them when contributing.
ja: 他にも最上位にあるフォルダがありますが、ほとんどはツールが使用するためのもので、コントリビュートする場合にそれらに直面することはほぼありません。

source: ### Colocated Tests {#colocated-tests}
ja: ### テストコードをソースコードのそばに格納する {#colocated-tests}

source: We don't have a top-level directory for unit tests.
ja: ユニットテスト用の最上位ディレクトリはありません。

source: Instead, we put them into a directory called `__tests__` relative to the files that they test.
ja: 代わりに、テスト対象のファイルのすぐ隣の `__tests__` というディレクトリに置いています。

source: For example, a test for [`setInnerHTML.js`](https://github.com/facebook/react/blob/87724bd87506325fcaf2648c70fc1f43411a87be/src/renderers/dom/client/utils/setInnerHTML.js) is located in [`__tests__/setInnerHTML-test.js`](https://github.com/facebook/react/blob/87724bd87506325fcaf2648c70fc1f43411a87be/src/renderers/dom/client/utils/__tests__/setInnerHTML-test.js) right next to it.
ja: 例えば、[`setInnerHTML.js`](https://github.com/facebook/react/blob/87724bd87506325fcaf2648c70fc1f43411a87be/src/renderers/dom/client/utils/setInnerHTML.js) のテストは、すぐ隣の [`__tests__/setInnerHTML-test.js`](https://github.com/facebook/react/blob/87724bd87506325fcaf2648c70fc1f43411a87be/src/renderers/dom/client/utils/__tests__/setInnerHTML-test.js) にあります。

source: ### Warnings and Invariants {#warnings-and-invariants}
ja: ### 警告と不変数 (Invariant) {#warnings-and-invariants}

source: The React codebase uses `console.error` to display warnings:
ja: React のコードベースは警告の表示に `console.error` を使用しています：

source: Warnings are only enabled in development.
ja: 警告は開発時にのみ有効になります。

source: In production, they are completely stripped out.
ja: 本番時には警告は完全に取り除かれます。

source: If you need to forbid some code path from executing, use `invariant` module instead:
ja: コードの一部の実行を禁止する必要がある場合は、代わりに `invariant` モジュールを使用してください：

source: **The invariant is thrown when the `invariant` condition is `false`.**
ja: **invariant は `invariant` 内の条件が `false` のときスローされます。

source: "Invariant" is just a way of saying "this condition always holds true".
ja: **"Invariant" とは "この条件は常に true である" ということの単なる言い換えです。

source: You can think about it as making an assertion.
ja: アサーションを作成していると考えることができます。

source: It is important to keep development and production behavior similar, so `invariant` throws both in development and in production.
ja: 開発バージョンと本番バージョンで同じ動作となるようにしておく事は重要ですので、`invariant` は両方の環境でスローされます。

source: The error messages are automatically replaced with error codes in production to avoid negatively affecting the byte size.
ja: 本番バージョンではエラーメッセージは自動的にエラーコードに変換され、バイト数に悪影響が出ることを避けます。

source: ### Development and Production {#development-and-production}
ja: ### 開発バージョンと本番バージョン {#development-and-production}

source: You can use `__DEV__` pseudo-global variable in the codebase to guard development-only blocks of code.
ja: コードベース内で `__DEV__` 擬似グローバル変数を使用して、開発用のコードブロックを保護することができます。

source: It is inlined during the compile step, and turns into `process.env.NODE_ENV !== 'production'` checks in the CommonJS builds.
ja: コンパイル時にインライン化され、CommonJS のビルド時には `process.env.NODE_ENV !== 'production'` というチェックに変換されます。

source: For standalone builds, it becomes `true` in the unminified build, and gets completely stripped out with the `if` blocks it guards in the minified build.
ja: スタンドアロンなビルドにおいては、minify されないビルドでは `true` となり、minify されたビルドではそれを囲む `if` ブロックごと完全に除去されます。

source: We recently started introducing [Flow](https://flow.org/) checks to the codebase.
ja: 最近私たちはコードベースに [Flow](https://flow.org/) によるチェックを導入し始めました。

source: Files marked with the `@flow` annotation in the license header comment are being typechecked.
ja: ライセンスヘッダで `@flow` アノテーションがマークされているファイルは型チェックをされています。

source: We accept pull requests [adding Flow annotations to existing code](https://github.com/facebook/react/pull/7600/files).
ja: [既存のコードに Flow アノテーションを追加する](https://github.com/facebook/react/pull/7600/files)プルリクエストを受けつけています。

source: Flow annotations look like this:
ja: Flow アノテーションは以下のようになります：

source: When possible, new code should use Flow annotations.
ja: 可能であれば、新しいコードは Flow アノテーションを使うべきです。

source: You can run `yarn flow` locally to check your code with Flow.
ja: `yarn flow` を実行することでローカル環境で Flow を使ってコードをチェックできます。

source: ### Multiple Packages {#multiple-packages}
ja: ### 複数のパッケージ {#multiple-packages}

source: React is a [monorepo](https://danluu.com/monorepo/).
ja: React は[単一リポジトリ (monorepo)](http://danluu.com/monorepo/) です。

source: Its repository contains multiple separate packages so that their changes can be coordinated together, and issues live in one place.
ja: そのリポジトリには複数の別々のパッケージが含まれているので、それらの変更はまとめて調整でき、issue も 1 箇所にまとまっています。

source: ### React Core {#react-core}
ja: ### React コア (core) {#react-core}

source: The "core" of React includes all the [top-level `React` APIs](/docs/top-level-api.html#react), for example:
ja: React の「コア (core)」は[最上位の React API](/docs/top-level-api.html#react) を全て含んでいます。例えば：

source: **React core only includes the APIs necessary to define components.** It does not include the [reconciliation](/docs/reconciliation.html) algorithm or any platform-specific code.
ja: **React core にはコンポーネントの定義に必要な API のみが含まれています。**[リコンシリエーション](/docs/reconciliation.html)のアルゴリズムやあらゆるプラットフォーム固有のコードは含まれません。

source: It is used both by React DOM and React Native components.
ja: コアは React DOM や React Native コンポーネントに使われています。

source: The code for React core is located in [`packages/react`](https://github.com/facebook/react/tree/main/packages/react) in the source tree.
ja: React core のコードはソースツリーの [`packages/react`](https://github.com/facebook/react/tree/master/packages/react) に格納されています。

source: It is available on npm as the [`react`](https://www.npmjs.com/package/react) package.
ja: npm では [`react`](https://www.npmjs.com/package/react) パッケージとして利用可能です。

source: The corresponding standalone browser build is called `react.js`, and it exports a global called `React`.
ja: 対応するスタンドアロンなブラウザ向けのビルドは `react.js` と呼ばれ、`React` というグローバル変数をエクスポートします。

source: ### Renderers {#renderers}
ja: ### レンダラ {#renderers}

source: React was originally created for the DOM but it was later adapted to also support native platforms with [React Native](https://reactnative.dev/).
ja: React は元々 DOM のために作成されましたが、後になって [React Native](https://reactnative.dev/) によりネイティブなプラットフォームもサポートするようになりました。

source: This introduced the concept of "renderers" to React internals.
ja: これにより React の内部に "レンダラ (renderer)" の概念が導入されました。

source: **Renderers manage how a React tree turns into the underlying platform calls.**
ja: **レンダラは React ツリーを、基盤となるプラットフォーム固有の呼び出しへと変換する方法を管理します。**

source: Renderers are also located in [`packages/`](https://github.com/facebook/react/tree/main/packages/):
ja: レンダラは [`packages/`](https://github.com/facebook/react/tree/master/packages/) にも格納されています：

source: * [React DOM Renderer](https://github.com/facebook/react/tree/main/packages/react-dom) renders React components to the DOM. It implements [top-level `ReactDOM` APIs](/docs/react-dom.html) and is available as [`react-dom`](https://www.npmjs.com/package/react-dom) npm package.
ja: * [React DOM Renderer](https://github.com/facebook/react/tree/master/packages/react-dom) は React コンポーネントを DOM に変換します。[トップレベルの `ReactDOM` API](/docs/react-dom.html) を実装し、npm では [`react-dom`](https://www.npmjs.com/package/react-dom) パッケージとして利用可能です。

source: It can also be used as standalone browser bundle called `react-dom.js` that exports a `ReactDOM` global.
ja: `react-dom.js` と呼ばれるスタンドアロンなブラウザ向けバンドルとしても使用でき、`ReactDOM` というグローバル変数をエクスポートします。

source: * [React Native Renderer](https://github.com/facebook/react/tree/main/packages/react-native-renderer) renders React components to native views.
ja: * [React Native Renderer](https://github.com/facebook/react/tree/master/packages/react-native-renderer) は React コンポーネントをネイティブのビューに変換します。

source: It is used internally by React Native.
ja: React Native の内部で使われています。

source: * [React Test Renderer](https://github.com/facebook/react/tree/main/packages/react-test-renderer) renders React components to JSON trees.
ja: * [React Test Renderer](https://github.com/facebook/react/tree/master/packages/react-test-renderer) は React コンポーネントを JSON ツリーに変換します。

source: It is used by the [Snapshot Testing](https://facebook.github.io/jest/blog/2016/07/27/jest-14.html) feature of [Jest](https://facebook.github.io/jest) and is available as [react-test-renderer](https://www.npmjs.com/package/react-test-renderer) npm package.
ja: [Jest](https://facebook.github.io/jest) の[スナップショットテスト機能](https://facebook.github.io/jest/blog/2016/07/27/jest-14.html)で使用され、npm では [react-test-renderer](https://www.npmjs.com/package/react-test-renderer) パッケージとして利用可能です。

source: The only other officially supported renderer is [`react-art`](https://github.com/facebook/react/tree/main/packages/react-art).
ja: その他に公式にサポートしているレンダラは [`react-art`](https://github.com/facebook/react/tree/master/packages/react-art) だけです。

source: It used to be in a separate [GitHub repository](https://github.com/reactjs/react-art) but we moved it into the main source tree for now.
ja: 個別の [GitHub リポジトリ](https://github.com/reactjs/react-art)にありましたが、現在はメインのソースツリーに移動しました。

source: >**Note:** > >Technically the [`react-native-renderer`](https://github.com/facebook/react/tree/main/packages/react-native-renderer) is a very thin layer that teaches React to interact with React Native implementation.
ja: >**補足：** > >技術的に、[`react-native-renderer`](https://github.com/facebook/react/tree/master/packages/react-native-renderer) は React に React Native の実装とやり取りの方法を教える非常に薄い層です。

source: The real platform-specific code managing the native views lives in the [React Native repository](https://github.com/facebook/react-native) together with its components.
ja: ネイティブのビューを管理する実際のプラットフォーム固有のコードは、コンポーネントと共に [React Native リポジトリ](https://github.com/facebook/react-native) にあります。

source: ### Reconcilers {#reconcilers}
ja: ### リコンサイラ (reconciler) {#reconcilers}

source: Even vastly different renderers like React DOM and React Native need to share a lot of logic.
ja: React DOM と React Native のように大幅に異なるレンダラでも多くのロジックを共有する必要があります。

source: In particular, the [reconciliation](/docs/reconciliation.html) algorithm should be as similar as possible so that declarative rendering, custom components, state, lifecycle methods, and refs work consistently across platforms.
ja: 特に、ツリーの[リコンシリエーション](/docs/reconciliation.html)のアルゴリズムは可能なかぎり同じものにして、宣言型レンダリング、独自コンポーネント、state、ライフサイクルメソッドおよび ref がプラットフォーム間で一貫した動作となるようにするべきです。

source: To solve this, different renderers share some code between them.
ja: 異なるレンダラ間でコードの一部を共有することでこの課題を解決します。

source: We call this part of React a "reconciler".
ja: React のこの箇所を "リコンサイラ（reconciler, 差分検出処理）" と呼んでいます。

source: When an update such as `setState()` is scheduled, the reconciler calls `render()` on components in the tree and mounts, updates, or unmounts them.
ja: `setState()` のような更新がスケジュールされると、差分検出処理ではツリー内のコンポーネントで `render()` を呼び出して、コンポーネントをマウント、更新、もしくはアンマウントします。

source: Reconcilers are not packaged separately because they currently have no public API.
ja: リコンサイラは、パブリック API がないため、個別にパッケージ化されていません。

source: Instead, they are exclusively used by renderers such as React DOM and React Native.
ja: 代わりに、それらは React DOM や React Native などのレンダラーによってのみ使用されます。

source: ### Stack Reconciler {#stack-reconciler}
ja: ### スタック (stack) リコンサイラ {#stack-reconciler}

source: The "stack" reconciler is the implementation powering React 15 and earlier.
ja: "stack" リコンサイラは React 15 およびそれ以前で実装されています。

source: We have since stopped using it, but it is documented in detail in the [next section](/docs/implementation-notes.html).
ja: それ以降は使用されていませんが、[次のセクション](/docs/implementation-notes.html)では詳細に説明されています。

source: ### Fiber Reconciler {#fiber-reconciler}
ja: ### Fiber リコンサイラ {#fiber-reconciler}

source: The "fiber" reconciler is a new effort aiming to resolve the problems inherent in the stack reconciler and fix a few long-standing issues.
ja: "fiber" リコンサイラは stack リコンサイラが内在的に抱える問題を解決し、いくつかの長年の問題を修正することを目的とした新しい取り組みです。

source: It has been the default reconciler since React 16.
ja: React 16 以降はデフォルトのリコンサイラとなっています。

source: Its main goals are:
ja: 主な目的は以下の通りです：

source: * Ability to split interruptible work in chunks.
ja: * 中断可能な作業を小分けに分割する機能

source: * Ability to prioritize, rebase and reuse work in progress.
ja: * 進行中の作業に優先順位を付けたり、再配置や再利用をする機能

source: * Ability to yield back and forth between parents and children to support layout in React.
ja: * React でレイアウトをサポートするための親子間を行き来しながらレンダーする機能

source: * Ability to return multiple elements from `render()`.
ja: * render() から複数の要素を返す機能

source: * Better support for error boundaries.
ja: * error boundary のサポートの向上

source: You can read more about React Fiber Architecture [here](https://github.com/acdlite/react-fiber-architecture) and [here](https://blog.ag-grid.com/inside-fiber-an-in-depth-overview-of-the-new-reconciliation-algorithm-in-react).
ja: React Fiber のアーキテクチャに関して[ここ](https://github.com/acdlite/react-fiber-architecture)や[ここ](https://blog.ag-grid.com/inside-fiber-an-in-depth-overview-of-the-new-reconciliation-algorithm-in-react)で読むことができます。

source: While it has shipped with React 16, the async features are not enabled by default yet.
ja: React 16 と共にリリースされていますが、非同期機能についてはデフォルトではまだ有効化されていません。

source: Its source code is located in [`packages/react-reconciler`](https://github.com/facebook/react/tree/main/packages/react-reconciler).
ja: ソースコードは [`packages/react-reconciler`](https://github.com/facebook/react/tree/master/packages/react-reconciler) に格納されています。

source: ### Event System {#event-system}
ja: ### イベントシステム {#event-system}

source: React implements a layer over native events to smooth out cross-browser differences.
ja: React はブラウザ間でのイベント挙動の差異を吸収するため、ネイティブイベントの上にレイヤーを実装しています。

source: Its source code is located in [`packages/react-dom/src/events`](https://github.com/facebook/react/tree/main/packages/react-dom/src/events).
ja: ソースコードは [`packages/react-dom/src/events`](https://github.com/facebook/react/tree/master/packages/react-dom/src/events) にあります。

source: ### What Next?
ja: ### この次は？

source: Read the [next section](/docs/implementation-notes.html) to learn about the pre-React 16 implementation of reconciler in more detail.
ja: React 16 以前のリコンサイラについてより詳細に学ぶには[次のセクション](/docs/implementation-notes.html)を読んでください。

source: We haven't documented the internals of the new reconciler yet.
ja: 新しいリコンサイラの内部についてはまだドキュメント化していません。
